# Pandas - Week 12

***

# Memadukan `loc` dan `iloc` untuk melakukan seleksi data

## Import modules

In [1]:
import pandas as pd

## Persiapan Data Frame

In [2]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## Penggunaan `loc` dan `iloc` untuk melakukan seleksi data

In [3]:
df.iloc[15:20, :].loc[:, 'name':'age']

                                               name     sex   age
15                              Baumann, Mr. John D    male   NaN
16                         Baxter, Mr. Quigg Edmond    male  24.0
17  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
18                            Bazzani, Miss. Albina  female  32.0
19                             Beattie, Mr. Thomson    male  36.0

`iloc` digunakan untuk melakukan seleksi data berdasarkan index. Model akses untuk method `iloc` dan `iloc` selalu dimulai dari menspesifikasikan **baris** lalu dilanjutkan dengan **kolom**.

Pada kode di atas, `iloc` digunakan untuk menyeleksi data dari baris index ke 15 sampai 19, dan `loc` digunakan untuk menyeleksi kolom, mulai dari kolom `name` sampai ke kolom `age`.

In [4]:
df.loc[:, 'name':'age'].iloc[15:20, :] # versi reverse dari kode sebelumnya.

                                               name     sex   age
15                              Baumann, Mr. John D    male   NaN
16                         Baxter, Mr. Quigg Edmond    male  24.0
17  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
18                            Bazzani, Miss. Albina  female  32.0
19                             Beattie, Mr. Thomson    male  36.0

***

# Seleksi weekdays dan weekends pada data deret waktu (time series data)

## Import modules

In [5]:
import pandas as pd
import numpy as np

## Persiapan Data Frame

In [6]:
n_rows = 365
n_cols = 2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns = cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='D') # membuat index dengan tipe date.

df

D:\Anaconda\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

            col1  col2
2000-01-01    19     2
2000-01-02    16     2
2000-01-03    19    11
2000-01-04    15     1
2000-01-05    18     5
...          ...   ...
2000-12-26    18    10
2000-12-27    15     7
2000-12-28    11    18
2000-12-29    13    14
2000-12-30     1     9

[365 rows x 2 columns]

## Seleksi weekdays dan weekend

In [8]:
weekdays_df = df[df.index.dayofweek.isin([0, 1, 2, 3, 4])]
weekdays_df.head()

            col1  col2
2000-01-03    19    11
2000-01-04    15     1
2000-01-05    18     5
2000-01-06     3     6
2000-01-07     5    14

Seleksi weekdays dapat dilakukan dengan menggunakan method `daysofweek`. Method tersebut hanya dapat digunakan jika data frame yang dituju memiliki index berupa time series. 

Setelahnya, perlu dilakukan spesifikasi berupa index yang ingin dimasukkan. Pada kasus ini, mulai dari 0 - 4, karena index tersebut merepresentasikan weekdays.

In [9]:
weekdays_df = df[df.index.dayofweek.isin([5, 6])]
weekdays_df.head()

            col1  col2
2000-01-01    19     2
2000-01-02    16     2
2000-01-08    12     7
2000-01-09     6    10
2000-01-15     8     8

Kode di atas untuk melakukan seleksi weekends. Index yang dispesifikasikan adalah **5** dan **6** karena merepresentasikan haris Sabtu dan Minggu.